cctv180/STM32H743XI_Demo/User/bsp/src/bsp_uart.c
        /* USART1 interrupt DeInit */
        HAL_NVIC_DisableIRQ(USART1_IRQn);
        /* USER CODE BEGIN USART1_MspDeInit 1 */

        /* USER CODE END USART1_MspDeInit 1 */
    }
    else if (huart->Instance == USART3)
    {
        /* USER CODE BEGIN USART3_MspDeInit 0 */

        /* USER CODE END USART3_MspDeInit 0 */
        /* Peripheral clock disable */
        __HAL_RCC_USART3_CLK_DISABLE();

        /**USART3 GPIO Configuration
        PB10     ------> USART3_TX
        PB11     ------> USART3_RX
        */
        HAL_GPIO_DeInit(GPIOB, GPIO_PIN_10 | GPIO_PIN_11);

        /* USART3 DMA DeInit */
        HAL_DMA_DeInit(huart->hdmarx);
        HAL_DMA_DeInit(huart->hdmatx);

        /* USART3 interrupt DeInit */
        HAL_NVIC_DisableIRQ(USART3_IRQn);
        /* USER CODE BEGIN USART3_MspDeInit 1 */

        /* USER CODE END USART3_MspDeInit 1 */
    }
    else if (huart->Instance == USART6)
    {
        /* USER CODE BEGIN USART6_MspDeInit 0 */

        /* USER CODE END USART6_MspDeInit 0 */
        /* Peripheral clock disable */
        __HAL_RCC_USART6_CLK_DISABLE();

        /**USART6 GPIO Configuration
        PG14     ------> USART6_TX
        PC7     ------> USART6_RX
        */
        HAL_GPIO_DeInit(GPIOG, GPIO_PIN_14);

        HAL_GPIO_DeInit(GPIOC, GPIO_PIN_7);

        /* USART6 DMA DeInit */
        HAL_DMA_DeInit(huart->hdmarx);
        HAL_DMA_DeInit(huart->hdmatx);

        /* USART6 interrupt DeInit */
        HAL_NVIC_DisableIRQ(USART6_IRQn);
        /* USER CODE BEGIN USART6_MspDeInit 1 */

        /* USER CODE END USART6_MspDeInit 1 */
    }
}

/**
 * [HAL_UARTEx_RxEventCallback description]
 *
 * @return  void    [return description]
 */
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size)
{
    UART_T *pUart = BaseToUart(huart->Instance);

    if (pUart != 0)
    {
        uint16_t space = ringbuffer_space_len(&pUart->rx_kfifo);                                         // 剩余空间
        uint16_t index_new = Size & (pUart->rx_kfifo.buffer_size - 1);                                   // 新写入指针
        uint16_t length = (index_new - pUart->rx_kfifo.write_index) & (pUart->rx_kfifo.buffer_size - 1); // 新写入长度

        if (pUart->rx_kfifo.write_index > index_new) // 满一圈
        {
            pUart->rx_kfifo.write_mirror = ~pUart->rx_kfifo.write_mirror;
            if (length > space)
            {
                pUart->rx_kfifo.read_mirror = ~pUart->rx_kfifo.read_mirror;
            }
        }
        if (length > space)
        {
            pUart->rx_kfifo.read_index = index_new;
        }
        pUart->rx_kfifo.write_index = index_new;

        if (pUart->ReciveNew)
        {
            pUart->ReciveNew(length); /* 比如，交给MODBUS解码程序处理字节流 */
        }
    }
}

/**
 * [HAL_UART_TxCpltCallback description]
 *
 * @return  void    [return description]
 */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
    UART_T *pUart = BaseToUart(huart->Instance);
    uint16_t len;
    if (pUart != 0)
    {
        len = ringbuffer_data_len(&pUart->tx_kfifo);
        if (len == 0)
        {
            /* 回调函数, 一般用来处理RS485通信，将RS485芯片设置为接收模式，避免抢占总线 */
            if (pUart->SendOver)
            {
                pUart->SendOver();
            }
            pUart->Sending = FALSE;
            return;
        }
        else
        {
            if (pUart->tx_kfifo.buffer_size - pUart->tx_kfifo.read_index > len)
            {
                /* 不用回绕 */
                HAL_UART_Transmit_DMA(pUart->huart, &(pUart->tx_kfifo.buffer_ptr[pUart->tx_kfifo.read_index]), len);
                pUart->tx_kfifo.read_index += len;
            }
            else
            {
                HAL_UART_Transmit_DMA(pUart->huart, &(pUart->tx_kfifo.buffer_ptr[pUart->tx_kfifo.read_index]), pUart->tx_kfifo.buffer_size - pUart->tx_kfifo.read_index);
                pUart->tx_kfifo.read_mirror = ~pUart->tx_kfifo.read_mirror;
                pUart->tx_kfifo.read_index = 0;
            }
        }
    }
}

/**
 * @brief This function handles USART1 global interrupt.
 */
#if UART1_FIFO_EN == 1
void USART1_IRQHandler(void)
{
    HAL_UART_IRQHandler(&huart1);
}
#endif

/**
 * @brief This function handles USART3 global interrupt.
 */
#if UART3_FIFO_EN == 1
void USART3_IRQHandler(void)
{
    HAL_UART_IRQHandler(&huart3);
}
#endif

/**
 * @brief This function handles USART6 global interrupt.
 */
#if UART6_FIFO_EN == 1
void USART6_IRQHandler(void)
{
    HAL_UART_IRQHandler(&huart6);
}
#endif

/*
*********************************************************************************************************
*   函 数 名: BaseToUart
*   功能说明: 将UART基地址转换为UART指针
*   形    参: _pBase: UART基地址(USART1 - USART8)
*   返 回 值: uart指针
*********************************************************************************************************
*/
static UART_T *BaseToUart(USART_TypeDef *_pBase)
{
    if (_pBase == USART1)
    {
#if UART1_FIFO_EN == 1
        return &g_tUart1;
#else
        return 0;
#endif
    }
#if UART2_FIFO_EN == 1
    else if (_pBase == USART2)
    {
        return &g_tUart2;
    }
#endif
#if UART3_FIFO_EN == 1
    else if (_pBase == USART3)
    {
        return &g_tUart3;
    }
#endif
#if UART4_FIFO_EN == 1
    else if (_pBase == UART4)
    {
        return &g_tUart4;
    }
#endif
#if UART5_FIFO_EN == 1
    else if (_pBase == UART5)
    {
        return &g_tUart5;
    }
#endif
#if UART6_FIFO_EN == 1
    else if (_pBase == USART6)
    {
        return &g_tUart6;
    }
#endif
#if UART7_FIFO_EN == 1
    else if (_pBase == UART7)
    {
        return &g_tUart7;
    }
#endif
#if UART8_FIFO_EN == 1
    else if (_pBase == UART8)
    {
        return &g_tUart8;
    }
#endif
    /* 不做任何处理 */
    return 0;
}

/*
*********************************************************************************************************
*   函 数 名: ComToUart
*   功能说明: 将COM端口号转换为UART指针
*   形    参: _ucPort: 端口号(COM1 - COM8)
*   返 回 值: uart指针
*********************************************************************************************************
*/
static UART_T *ComToUart(COM_PORT_E _ucPort)
{
    if (_ucPort == COM1)
    {
#if UART1_FIFO_EN == 1
        return &g_tUart1;
#else
        return 0;
#endif
    }
#if UART2_FIFO_EN == 1
    else if (_ucPort == COM2)
    {
        return &g_tUart2;
    }
#endif
#if UART3_FIFO_EN == 1
    else if (_ucPort == COM3)
    {
        return &g_tUart3;
    }
#endif
#if UART4_FIFO_EN == 1
    else if (_ucPort == COM4)
    {
        return &g_tUart4;
    }
#endif
#if UART5_FIFO_EN == 1
    else if (_ucPort == COM5)
    {
        return &g_tUart5;
    }
#endif
#if UART6_FIFO_EN == 1
    else if (_ucPort == COM6)
    {
        return &g_tUart6;
    }
#endif
#if UART7_FIFO_EN == 1
    else if (_ucPort == COM7)
    {
        return &g_tUart7;
    }
#endif
#if UART8_FIFO_EN == 1
    else if (_ucPort == COM8)
    {
        return &g_tUart8;
    }
#endif
    /* 不做任何处理 */
    return 0;
}

