cctv180/STM32H743XI_Demo/User/bsp/src/bsp_uart.c
/*
*********************************************************************************************************
*   函 数 名: UartSend
*   功能说明: 填写数据到UART发送缓冲区,并启动发送中断。中断处理函数发送完毕后，自动关闭发送中断
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
static void UartSend(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen)
{
    uint16_t len;

    len = ringbuffer_put(&_pUart->tx_kfifo, _ucaBuf, _usLen);

    /* 按地址清理数据高速缓存行 将传输缓冲区中的更新数据写入RAM */
    SCB_CleanDCache_by_Addr((uint32_t *)_pUart->tx_kfifo.buffer_ptr, _pUart->tx_kfifo.buffer_size);

    /* DMA不忙 */
    // if (HAL_DMA_STATE_BUSY != HAL_DMA_GetState(_pUart->huart->hdmatx))
    if (_pUart->Sending != TRUE)
    {
        _pUart->Sending = TRUE;
        if (_pUart->tx_kfifo.buffer_size - _pUart->tx_kfifo.read_index > len)
        {
            /* 不用回绕 */
            HAL_UART_Transmit_DMA(_pUart->huart, &(_pUart->tx_kfifo.buffer_ptr[_pUart->tx_kfifo.read_index]), len);
            _pUart->tx_kfifo.read_index += len;
        }
        else
        {
            HAL_UART_Transmit_DMA(_pUart->huart, &(_pUart->tx_kfifo.buffer_ptr[_pUart->tx_kfifo.read_index]), _pUart->tx_kfifo.buffer_size - _pUart->tx_kfifo.read_index);
            _pUart->tx_kfifo.read_mirror = ~_pUart->tx_kfifo.read_mirror;
            _pUart->tx_kfifo.read_index = 0;
        }
    }

#if 0  /// TODO 超长截断末尾。
    while (len < _usLen)
    {
        len += ringbuffer_put(&_pUart->tx_kfifo, _ucaBuf + len, _usLen - len);
    }
#endif // 0
}

/*
*********************************************************************************************************
*   函 数 名: comSendBuf
*   功能说明: 向串口发送一组数据。数据放到发送缓冲区后立即返回，由中断服务程序在后台完成发送
*   形    参: _ucPort: 端口号(COM1 - COM8)
*             _ucaBuf: 待发送的数据缓冲区
*             _usLen : 数据长度
*   返 回 值: 无
*********************************************************************************************************
*/
void comSendBuf(COM_PORT_E _ucPort, uint8_t *_ucaBuf, uint16_t _usLen)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return;
    }

    if (pUart->SendBefor != 0)
    {
        pUart->SendBefor(); /* 如果是RS485通信，可以在这个函数中将RS485设置为发送模式 */
    }

    UartSend(pUart, _ucaBuf, _usLen);
}

/*
*********************************************************************************************************
*   函 数 名: comSendChar
*   功能说明: 向串口发送1个字节。数据放到发送缓冲区后立即返回，由中断服务程序在后台完成发送
*   形    参: _ucPort: 端口号(COM1 - COM8)
*             _ucByte: 待发送的数据
*   返 回 值: 无
*********************************************************************************************************
*/
void comSendChar(COM_PORT_E _ucPort, uint8_t _ucByte)
{
    comSendBuf(_ucPort, &_ucByte, 1);
}

/*
*********************************************************************************************************
*   函 数 名: comGetChar
*   功能说明: 从接收缓冲区读取1字节，非阻塞。无论有无数据均立即返回。
*   形    参: _ucPort: 端口号(COM1 - COM8)
*             _pByte: 接收到的数据存放在这个地址
*   返 回 值: 0 表示无数据, 1 表示读取到有效字节
*********************************************************************************************************
*/
uint8_t comGetChar(COM_PORT_E _ucPort, uint8_t *_pByte)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return 0;
    }
    /* CPU访问前，将Cache对应的区域无效化 */
    SCB_InvalidateDCache_by_Addr((uint32_t *)USER_ALIGN_DOWN((uint32_t)pUart->rx_kfifo.buffer_ptr + pUart->rx_kfifo.read_index, 32), (int32_t)32);
    return ringbuffer_getchar(&pUart->rx_kfifo, _pByte);
}

/*
*********************************************************************************************************
*   函 数 名: comGetBuf
*   功能说明: 从接收缓冲区读取指定长度，非阻塞。无论有无数据均立即返回。
*   形    参: _ucPort: 端口号(COM1 - COM8)
*             _pByte: 接收到的数据存放在这个地址
*   返 回 值: 0 表示无数据, x 表示读取到有效字节
*********************************************************************************************************
*/
uint16_t comGetBuf(COM_PORT_E _ucPort, uint8_t *_pByte, uint16_t _usLen)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return 0;
    }
    /* CPU访问前，将Cache对应的区域无效化 */
    SCB_InvalidateDCache_by_Addr((uint32_t *)pUart->rx_kfifo.buffer_ptr, pUart->rx_kfifo.buffer_size);
    return ringbuffer_get(&pUart->rx_kfifo, _pByte, _usLen);
}

/*
*********************************************************************************************************
*   函 数 名: comClearTxFifo
*   功能说明: 清零串口发送缓冲区
*   形    参: _ucPort: 端口号(COM1 - COM8)
*   返 回 值: 无
*********************************************************************************************************
*/
void comClearTxFifo(COM_PORT_E _ucPort)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return;
    }

    ringbuffer_reset(&pUart->tx_kfifo);
}

/*
*********************************************************************************************************
*   函 数 名: comClearRxFifo
*   功能说明: 清零串口接收缓冲区
*   形    参: _ucPort: 端口号(COM1 - COM8)
*   返 回 值: 无
*********************************************************************************************************
*/
void comClearRxFifo(COM_PORT_E _ucPort)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return;
    }
    pUart->rx_kfifo.read_index = pUart->rx_kfifo.write_index;
    pUart->rx_kfifo.read_mirror = 0;
    pUart->rx_kfifo.write_mirror = 0;
}

/*
*********************************************************************************************************
*   函 数 名: comSetBaud
*   功能说明: 设置串口的波特率. 本函数固定设置为无校验，收发都使能模式
*   形    参: _ucPort: 端口号(COM1 - COM8)
*             _BaudRate: 波特率，8倍过采样  波特率.0-12.5Mbps
*                               16倍过采样 波特率.0-6.25Mbps
*   返 回 值: ret
*********************************************************************************************************
*/
int comSetBaud(COM_PORT_E _ucPort, uint32_t _BaudRate)
{
    UART_T *pUart;
    UART_HandleTypeDef *huart;

    uint16_t brrtemp;
    UART_ClockSourceTypeDef clocksource;
    uint32_t usartdiv;
    HAL_StatusTypeDef ret = HAL_OK;
    uint32_t lpuart_ker_ck_pres;
    PLL2_ClocksTypeDef pll2_clocks;
    PLL3_ClocksTypeDef pll3_clocks;
    uint32_t pclk;

