cctv180/STM32H743XI_Demo/User/bsp/src/bsp_uart.c
    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return -1;
    }

    huart = pUart->huart;
    huart->Init.BaudRate = _BaudRate;
    /*     参考 stm32xx_hal_uart.c --> UART_SetConfig() 中寄存器 BRR 配置部分。   */
    /*-------------------------- USART BRR Configuration -----------------------*/
    UART_GETCLOCKSOURCE(huart, clocksource);

    /* Check LPUART instance */
    if (UART_INSTANCE_LOWPOWER(huart))
    {
        /* Retrieve frequency clock */
        switch (clocksource)
        {
        case UART_CLOCKSOURCE_D3PCLK1:
            pclk = HAL_RCCEx_GetD3PCLK1Freq();
            break;
        case UART_CLOCKSOURCE_PLL2:
            HAL_RCCEx_GetPLL2ClockFreq(&pll2_clocks);
            pclk = pll2_clocks.PLL2_Q_Frequency;
            break;
        case UART_CLOCKSOURCE_PLL3:
            HAL_RCCEx_GetPLL3ClockFreq(&pll3_clocks);
            pclk = pll3_clocks.PLL3_Q_Frequency;
            break;
        case UART_CLOCKSOURCE_HSI:
            if (__HAL_RCC_GET_FLAG(RCC_FLAG_HSIDIV) != 0U)
            {
                pclk = (uint32_t)(HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> 3U));
            }
            else
            {
                pclk = (uint32_t)HSI_VALUE;
            }
            break;
        case UART_CLOCKSOURCE_CSI:
            pclk = (uint32_t)CSI_VALUE;
            break;
        case UART_CLOCKSOURCE_LSE:
            pclk = (uint32_t)LSE_VALUE;
            break;
        default:
            pclk = 0U;
            ret = HAL_ERROR;
            break;
        }

        /* If proper clock source reported */
        if (pclk != 0U)
        {
            /* Compute clock after Prescaler */
            lpuart_ker_ck_pres = (pclk / UARTPrescTable[huart->Init.ClockPrescaler]);

            /* Ensure that Frequency clock is in the range [3 * baudrate, 4096 * baudrate] */
            if ((lpuart_ker_ck_pres < (3U * huart->Init.BaudRate)) ||
                (lpuart_ker_ck_pres > (4096U * huart->Init.BaudRate)))
            {
                ret = HAL_ERROR;
            }
            else
            {
                /* Check computed UsartDiv value is in allocated range
                   (it is forbidden to write values lower than 0x300 in the LPUART_BRR register) */
                usartdiv = (uint32_t)(UART_DIV_LPUART(pclk, huart->Init.BaudRate, huart->Init.ClockPrescaler));
                if ((usartdiv >= LPUART_BRR_MIN) && (usartdiv <= LPUART_BRR_MAX))
                {
                    huart->Instance->BRR = usartdiv;
                }
                else
                {
                    ret = HAL_ERROR;
                }
            } /* if ( (lpuart_ker_ck_pres < (3 * huart->Init.BaudRate) ) ||
                      (lpuart_ker_ck_pres > (4096 * huart->Init.BaudRate) )) */
        } /* if (pclk != 0) */
    }
    /* Check UART Over Sampling to set Baud Rate Register */
    else if (huart->Init.OverSampling == UART_OVERSAMPLING_8)
    {
        switch (clocksource)
        {
        case UART_CLOCKSOURCE_D2PCLK1:
            pclk = HAL_RCC_GetPCLK1Freq();
            break;
        case UART_CLOCKSOURCE_D2PCLK2:
            pclk = HAL_RCC_GetPCLK2Freq();
            break;
        case UART_CLOCKSOURCE_PLL2:
            HAL_RCCEx_GetPLL2ClockFreq(&pll2_clocks);
            pclk = pll2_clocks.PLL2_Q_Frequency;
            break;
        case UART_CLOCKSOURCE_PLL3:
            HAL_RCCEx_GetPLL3ClockFreq(&pll3_clocks);
            pclk = pll3_clocks.PLL3_Q_Frequency;
            break;
        case UART_CLOCKSOURCE_HSI:
            if (__HAL_RCC_GET_FLAG(RCC_FLAG_HSIDIV) != 0U)
            {
                pclk = (uint32_t)(HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> 3U));
            }
            else
            {
                pclk = (uint32_t)HSI_VALUE;
            }
            break;
        case UART_CLOCKSOURCE_CSI:
            pclk = (uint32_t)CSI_VALUE;
            break;
        case UART_CLOCKSOURCE_LSE:
            pclk = (uint32_t)LSE_VALUE;
            break;
        default:
            pclk = 0U;
            ret = HAL_ERROR;
            break;
        }

        /* USARTDIV must be greater than or equal to 0d16 */
        if (pclk != 0U)
        {
            usartdiv = (uint32_t)(UART_DIV_SAMPLING8(pclk, huart->Init.BaudRate, huart->Init.ClockPrescaler));
            if ((usartdiv >= UART_BRR_MIN) && (usartdiv <= UART_BRR_MAX))
            {
                brrtemp = (uint16_t)(usartdiv & 0xFFF0U);
                brrtemp |= (uint16_t)((usartdiv & (uint16_t)0x000FU) >> 1U);
                huart->Instance->BRR = brrtemp;
            }
            else
            {
                ret = HAL_ERROR;
            }
        }
    }
    else
    {
        switch (clocksource)
        {
        case UART_CLOCKSOURCE_D2PCLK1:
            pclk = HAL_RCC_GetPCLK1Freq();
            break;
        case UART_CLOCKSOURCE_D2PCLK2:
            pclk = HAL_RCC_GetPCLK2Freq();
            break;
        case UART_CLOCKSOURCE_PLL2:
            HAL_RCCEx_GetPLL2ClockFreq(&pll2_clocks);
            pclk = pll2_clocks.PLL2_Q_Frequency;
            break;
        case UART_CLOCKSOURCE_PLL3:
            HAL_RCCEx_GetPLL3ClockFreq(&pll3_clocks);
            pclk = pll3_clocks.PLL3_Q_Frequency;
            break;
        case UART_CLOCKSOURCE_HSI:
            if (__HAL_RCC_GET_FLAG(RCC_FLAG_HSIDIV) != 0U)
            {
                pclk = (uint32_t)(HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER() >> 3U));
            }
            else
            {
                pclk = (uint32_t)HSI_VALUE;
            }
            break;
        case UART_CLOCKSOURCE_CSI:
            pclk = (uint32_t)CSI_VALUE;
            break;
        case UART_CLOCKSOURCE_LSE:
            pclk = (uint32_t)LSE_VALUE;
            break;
        default:
            pclk = 0U;
            ret = HAL_ERROR;
            break;
        }

        if (pclk != 0U)
        {
            /* USARTDIV must be greater than or equal to 0d16 */
            usartdiv = (uint32_t)(UART_DIV_SAMPLING16(pclk, huart->Init.BaudRate, huart->Init.ClockPrescaler));
            if ((usartdiv >= UART_BRR_MIN) && (usartdiv <= UART_BRR_MAX))
            {
                huart->Instance->BRR = (uint16_t)usartdiv;
            }
            else
            {
                ret = HAL_ERROR;
            }
        }
    }
    return ret;
}

