cctv180/STM32H743XI_Demo/User/bsp/src/bsp_uart.c
/*
*********************************************************************************************************
*   函 数 名: comGetLen
*   功能说明: 取出串口缓冲区个数。
*   形    参:  _pUart : 串口设备
*   返 回 值: 1为空。0为不空。
*********************************************************************************************************
*/
uint16_t comGetLen(COM_PORT_E _ucPort)
{
    UART_T *pUart;

    pUart = ComToUart(_ucPort);
    if (pUart == 0)
    {
        return 0;
    }
    return ringbuffer_data_len(&pUart->rx_kfifo);
}

/* 如果是RS485通信，请按如下格式编写函数， 我们仅举了 USART3作为RS485的例子 */

/*
*********************************************************************************************************
*    函 数 名: RS485_InitTXE
*    功能说明: 配置RS485发送使能口线 TXE
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
static void RS485_InitTXE(void)
{
    GPIO_InitTypeDef gpio_init;

    /* 打开GPIO时钟 */
    RS485_TXEN_GPIO_CLK_ENABLE();

    /* 配置引脚为推挽输出 */
    gpio_init.Mode = GPIO_MODE_OUTPUT_PP;        /* 推挽输出 */
    gpio_init.Pull = GPIO_NOPULL;                /* 上下拉电阻不使能 */
    gpio_init.Speed = GPIO_SPEED_FREQ_VERY_HIGH; /* GPIO速度等级 */
    gpio_init.Pin = RS485_TXEN_PIN;
    HAL_GPIO_Init(RS485_TXEN_GPIO_PORT, &gpio_init);
}

/*
*********************************************************************************************************
*    函 数 名: RS485_SetBaud
*    功能说明: 修改485串口的波特率。
*    形    参: _baud : 8倍过采样  波特率.0-12.5Mbps
*                     16倍过采样 波特率.0-6.25Mbps
*    返 回 值: 无
*********************************************************************************************************
*/
void RS485_SetBaud(uint32_t _baud)
{
    comSetBaud(COM3, _baud);
}

/*
*********************************************************************************************************
*    函 数 名: RS485_SendBefor
*    功能说明: 发送数据前的准备工作。对于RS485通信，请设置RS485芯片为发送状态，
*              并修改 UartVarInit()中的函数指针等于本函数名，比如 g_tUart2.SendBefor = RS485_SendBefor
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
static void RS485_SendBefor(void)
{
    RS485_TX_EN(); /* 切换RS485收发芯片为发送模式 */
}

/*
*********************************************************************************************************
*    函 数 名: RS485_SendOver
*    功能说明: 发送一串数据结束后的善后处理。对于RS485通信，请设置RS485芯片为接收状态，
*              并修改 UartVarInit()中的函数指针等于本函数名，比如 g_tUart2.SendOver = RS485_SendOver
*    形    参: 无
*    返 回 值: 无
*********************************************************************************************************
*/
static void RS485_SendOver(void)
{
    RS485_RX_EN(); /* 切换RS485收发芯片为接收模式 */
}

/*
*********************************************************************************************************
*    函 数 名: RS485_ReciveNew
*    功能说明: 接收到新的数据
*    形    参: _byte 接收到的新数据
*    返 回 值: 无
*********************************************************************************************************
*/
static void RS485_ReciveNew(uint8_t _byte)
{
    // MODH_ReciveNew(_byte);
}

/*
*********************************************************************************************************
*    函 数 名: RS485_SendBuf
*    功能说明: 通过RS485芯片发送一串数据。注意，本函数不等待发送完毕。
*    形    参: _ucaBuf : 数据缓冲区
*              _usLen : 数据长度
*    返 回 值: 无
*********************************************************************************************************
*/
void RS485_SendBuf(uint8_t *_ucaBuf, uint16_t _usLen)
{
    comSendBuf(COM3, _ucaBuf, _usLen);
}

/*
*********************************************************************************************************
*    函 数 名: RS485_SendStr
*    功能说明: 向485总线发送一个字符串，0结束。
*    形    参: _pBuf 字符串，0结束
*    返 回 值: 无
*********************************************************************************************************
*/
void RS485_SendStr(char *_pBuf)
{
    RS485_SendBuf((uint8_t *)_pBuf, strlen(_pBuf));
}

/*
*********************************************************************************************************
*   函 数 名: UartVarInit
*   功能说明: 初始化串口相关的变量
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
static void UartVarInit(void)
{
#if UART1_FIFO_EN == 1
    g_tUart1.huart = &huart1;
    g_tUart1.SendBefor = 0; /* 发送数据前的回调函数 */
    g_tUart1.SendOver = 0;  /* 发送完毕后的回调函数 */
    g_tUart1.ReciveNew = 0; /* 接收到新数据后的回调函数 */
    g_tUart1.Sending = 0;   /* 正在发送中标志 */
#endif
#if UART2_FIFO_EN == 1
    g_tUart2.huart = &huart2;
    g_tUart2.SendBefor = 0; /* 发送数据前的回调函数 */
    g_tUart2.SendOver = 0;  /* 发送完毕后的回调函数 */
    g_tUart2.ReciveNew = 0; /* 接收到新数据后的回调函数 */
    g_tUart2.Sending = 0;   /* 正在发送中标志 */
#endif
#if UART3_FIFO_EN == 1
    g_tUart3.huart = &huart3;
    g_tUart3.SendBefor = RS485_SendBefor; /* 发送数据前的回调函数 */
    g_tUart3.SendOver = RS485_SendOver;   /* 发送完毕后的回调函数 */
    g_tUart3.ReciveNew = RS485_ReciveNew; /* 接收到新数据后的回调函数 */
    g_tUart3.Sending = 0;                 /* 正在发送中标志 */
#endif
#if UART4_FIFO_EN == 1
    g_tUart4.huart = &huart4;
    g_tUart4.SendBefor = 0; /* 发送数据前的回调函数 */
    g_tUart4.SendOver = 0;  /* 发送完毕后的回调函数 */
    g_tUart4.ReciveNew = 0; /* 接收到新数据后的回调函数 */
    g_tUart4.Sending = 0;   /* 正在发送中标志 */
#endif
#if UART5_FIFO_EN == 1
    g_tUart5.huart = &huart5;
    g_tUart5.SendBefor = 0; /* 发送数据前的回调函数 */
    g_tUart5.SendOver = 0;  /* 发送完毕后的回调函数 */
    g_tUart5.ReciveNew = 0; /* 接收到新数据后的回调函数 */
    g_tUart5.Sending = 0;   /* 正在发送中标志 */
#endif
#if UART6_FIFO_EN == 1
    g_tUart6.huart = &huart6;
    g_tUart6.SendBefor = 0; /* 发送数据前的回调函数 */
    g_tUart6.SendOver = 0;  /* 发送完毕后的回调函数 */
    g_tUart6.ReciveNew = 0; /* 接收到新数据后的回调函数 */
    g_tUart6.Sending = 0;   /* 正在发送中标志 */
#endif
#if UART7_FIFO_EN == 1
    g_tUart7.huart = &huart7;
    g_tUart7.SendBefor = 0; /* 发送数据前的回调函数 */
    g_tUart7.SendOver = 0;  /* 发送完毕后的回调函数 */
    g_tUart7.ReciveNew = 0; /* 接收到新数据后的回调函数 */
    g_tUart7.Sending = 0;   /* 正在发送中标志 */
#endif
}

/*
*********************************************************************************************************
*   函 数 名: bsp_InitUart
*   功能说明: 初始化串口硬件，并对全局变量赋初值.
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitUart(void)
{
    UartVarInit();   /* 必须先初始化全局变量,再配置硬件 */
    RS485_InitTXE(); /* 配置RS485芯片的发送使能硬件，配置为推挽输出 */
#if UART1_FIFO_EN == 1
    MX_USART1_UART_Init(); /* 初始化串口 */
    ringbuffer_init(&g_tUart1.tx_kfifo, s_tx_buf1, (UART1_TX_BUF_SIZE));
    ringbuffer_init(&g_tUart1.rx_kfifo, s_rx_buf1, roundup_pow_of_two(UART1_RX_BUF_SIZE));
    HAL_UARTEx_ReceiveToIdle_DMA(&huart1, s_rx_buf1, roundup_pow_of_two(UART1_RX_BUF_SIZE)); /* 启动DMA */
#endif
#if UART2_FIFO_EN == 1
    MX_USART2_UART_Init(); /* 初始化串口 */
    ringbuffer_init(&g_tUart2.tx_kfifo, s_tx_buf2, (UART2_TX_BUF_SIZE));
    ringbuffer_init(&g_tUart2.rx_kfifo, s_rx_buf2, roundup_pow_of_two(UART2_RX_BUF_SIZE));
    HAL_UARTEx_ReceiveToIdle_DMA(&huart2, s_rx_buf2, roundup_pow_of_two(UART2_RX_BUF_SIZE)); /* 启动DMA */
#endif
#if UART3_FIFO_EN == 1
    MX_USART3_UART_Init(); /* 初始化串口 */
    ringbuffer_init(&g_tUart3.tx_kfifo, s_tx_buf3, (UART3_TX_BUF_SIZE));
    ringbuffer_init(&g_tUart3.rx_kfifo, s_rx_buf3, roundup_pow_of_two(UART3_RX_BUF_SIZE));
    HAL_UARTEx_ReceiveToIdle_DMA(&huart3, s_rx_buf3, roundup_pow_of_two(UART3_RX_BUF_SIZE)); /* 启动DMA */
#endif
#if UART4_FIFO_EN == 1
    MX_USART4_UART_Init(); /* 初始化串口 */
    ringbuffer_init(&g_tUart4.tx_kfifo, s_tx_buf4, (UART4_TX_BUF_SIZE));
    ringbuffer_init(&g_tUart4.rx_kfifo, s_rx_buf4, roundup_pow_of_two(UART4_RX_BUF_SIZE));
    HAL_UARTEx_ReceiveToIdle_DMA(&huart4, s_rx_buf4, roundup_pow_of_two(UART4_RX_BUF_SIZE)); /* 启动DMA */
#endif
#if UART5_FIFO_EN == 1
    MX_USART5_UART_Init(); /* 初始化串口 */
    ringbuffer_init(&g_tUart5.tx_kfifo, s_tx_buf5, (UART5_TX_BUF_SIZE));
    ringbuffer_init(&g_tUart5.rx_kfifo, s_rx_buf5, roundup_pow_of_two(UART5_RX_BUF_SIZE));
    HAL_UARTEx_ReceiveToIdle_DMA(&huart5, s_rx_buf5, roundup_pow_of_two(UART5_RX_BUF_SIZE)); /* 启动DMA */
#endif
#if UART6_FIFO_EN == 1
    MX_USART6_UART_Init(); /* 初始化串口 */
    ringbuffer_init(&g_tUart6.tx_kfifo, s_tx_buf6, (UART6_TX_BUF_SIZE));
    ringbuffer_init(&g_tUart6.rx_kfifo, s_rx_buf6, roundup_pow_of_two(UART6_RX_BUF_SIZE));
    HAL_UARTEx_ReceiveToIdle_DMA(&huart6, s_rx_buf6, roundup_pow_of_two(UART6_RX_BUF_SIZE)); /* 启动DMA */
#endif
#if UART7_FIFO_EN == 1
    MX_USART7_UART_Init(); /* 初始化串口 */
    ringbuffer_init(&g_tUart7.tx_kfifo, s_tx_buf7, (UART7_TX_BUF_SIZE));
    ringbuffer_init(&g_tUart7.rx_kfifo, s_rx_buf7, roundup_pow_of_two(UART7_RX_BUF_SIZE));
    HAL_UARTEx_ReceiveToIdle_DMA(&huart7, s_rx_buf7, roundup_pow_of_two(UART7_RX_BUF_SIZE)); /* 启动DMA */
#endif
#if UART8_FIFO_EN == 1
    MX_USART8_UART_Init(); /* 初始化串口 */
    ringbuffer_init(&g_tUart8.tx_kfifo, s_tx_buf8, (UART8_TX_BUF_SIZE));
    ringbuffer_init(&g_tUart8.rx_kfifo, s_rx_buf8, roundup_pow_of_two(UART8_RX_BUF_SIZE));
    HAL_UARTEx_ReceiveToIdle_DMA(&huart8, s_rx_buf8, roundup_pow_of_two(UART8_RX_BUF_SIZE)); /* 启动DMA */
#endif
}

#if defined(__SHELL_H__) && defined(DEBUG_MODE)
static int com_uart(int argc, char *argv[])
{
    static int8_t com_num = 0;

    const char *help_info[] =
        {
            "probe Select Uart 1 - 8",
            "read len char buff",
            "write xxx",
            "clear",
            "baud XXX",
        };

    if (!strcmp(argv[1], "probe")) // 选择串口号
    {
        com_num = atoi(argv[2]);

        if (!ComToUart(com_num)) // 串口号错误列出串口
        {
            com_num = 0;
            printf("COM Select Error(Range");
            for (uint8_t i = 0; i <= 8; i++)
            {
                if ((ComToUart(i)))
                {
                    printf(" %d", i);
                }
            }
            printf(").\r\n");

