cctv180/STM32H743XI_Demo/User/bsp/src/bsp_uart.c
            return 0;
        }

        printf("COM Select %d OK\r\n", com_num);

        return 0;
    }
    else if (!strcmp(argv[1], "read"))
    {
        if (argc >= 2 && !strcmp(argv[2], "len"))
        {
            uint16_t length = comGetLen((COM_PORT_E)com_num);
            printf("length = %d\r\n", length);

            return 0;
        }
        else if (argc >= 2 && !strcmp(argv[2], "char"))
        {
            uint8_t data;
            if (comGetChar((COM_PORT_E)com_num, &data))
            {
                printf("read char = 0x%02X(%c)\r\n", data, data);
            }
            else
            {
                printf("read char NULL\r\n");
            }

            return 0;
        }
        else if (argc >= 2 && !strcmp(argv[2], "buff"))
        {
            if (argc >= 4)
            {

                uint16_t length = atoi(argv[3]);
                uint8_t *buff = malloc(length);
                if (!buff)
                {
                    printf("Low memory!\r\n");

                    return -1;
                }
                size_t size = comGetBuf((COM_PORT_E)com_num, buff, length);
                if (size)
                {
                    dump_hex(buff, size, 16);
                }
                else
                {
                    printf("read buff NULL\r\n");
                }

                free(buff);
            }
            else
            {
                printf("parameter Error.\r\ncom buff [len]\r\n");
            }
        }
        else
        {
            printf("parameter Error.\r\n");
            printf("%s ", argv[0]);
            printf("%s\r\n", help_info[1]);
            return -1;
        }
        printf("Select COM%d Read\r\n", com_num);
    }
    else if (!strcmp(argv[1], "write"))
    {
        if (argc >= 3)
        {
            comSendBuf((COM_PORT_E)com_num, (uint8_t *)argv[2], strlen(argv[2]));
        }
        else
        {
            printf("write parameter Error.\r\n");
            printf("%s ", argv[0]);
            printf("%s\r\n", help_info[2]);
            return -1;
        }
    }
    else if (!strcmp(argv[1], "clear"))
    {
        comClearRxFifo((COM_PORT_E)com_num);
        comClearTxFifo((COM_PORT_E)com_num);
    }
    else if (!strcmp(argv[1], "baud"))
    {
        uint32_t baud;
        if (argc >= 3)
        {
            baud = strtol(argv[2], NULL, 0);
            if (baud)
            {
                return comSetBaud((COM_PORT_E)com_num, baud);
            }
            else
            {
                printf("com baud error = 0\r\n");
            }
        }
        else
        {
            printf("parameter Error.\r\n");
            printf("%s ", argv[0]);
            printf("%s\r\n", help_info[4]);
            return -1;
        }
    }
    else
    {
        printf("Error Command\r\nUsage:\r\n");
        for (uint32_t i = 0; i < sizeof(help_info) / sizeof(char *); i++)
        {
            printf("%s ", argv[0]);
            printf("%s\r\n", help_info[i]);
        }
        printf("\r\n");
    }

    return 0;
}
// 导出到命令列表里
SHELL_EXPORT_CMD(SHELL_CMD_PERMISSION(0) | SHELL_CMD_TYPE(SHELL_TYPE_CMD_MAIN), com, com_uart, com find[dev | part]);
#endif // #ifdef DEBUG_MODE

/*
*********************************************************************************************************
*   函 数 名: fputc
*   功能说明: 重定义putc函数，这样可以使用printf函数从串口1打印输出
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
int fputc(int ch, FILE *f)
{
#if 1 /* 将需要printf的字符通过串口中断FIFO发送出去，printf函数会立即返回 */
    comSendChar(COM1, ch);

    return ch;
#else /* 采用阻塞方式发送每个字符,等待数据发送完毕 */
    /* 写一个字节到USART1 */
    USART6->TDR = ch;

    /* 等待发送结束 */
    while ((USART6->ISR & USART_ISR_TC) == 0)
    {
    }

    return ch;
#endif
}

/*
*********************************************************************************************************
*   函 数 名: fgetc
*   功能说明: 重定义getc函数，这样可以使用getchar函数从串口1输入数据
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
int fgetc(FILE *f)
{

#if 1 /* 从串口接收FIFO中取1个数据, 只有取到数据才返回 */
    uint8_t ucData;

    while (comGetChar(COM1, &ucData) == 0)
        ;

    return ucData;
#else
    /* 等待接收到数据 */
    while ((USART1->ISR & USART_ISR_RXNE) == 0)
    {
    }

    return (int)USART1->RDR;
#endif
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
